app/controllers/dice_controller.rb

  def shake
		dice = Dice.new
		@result = dice.shake
		Roll.create :value => @result
---
INSERT INTO "rolls" ("created_at", "updated_at", "value") VALUES('2009-12-09 02:34:26', '2009-12-09 02:34:26', 1)

	def report
		@count = Roll.count
		@statistics = Roll.count(:group => :value)
---
SELECT count(*) AS count_all, value AS value FROM "rolls" GROUP BY value
SELECT * FROM "rolls"